In [29]:
import pandas as pd

In [31]:
temp = pd.DataFrame({'id':[1,1,1,4,5,6],'value':[22,2,3,4,5,6],'value2':[2222,222,23,43,45,56]});temp

   id  value  value2
0   1     22    2222
1   1      2     222
2   1      3      23
3   4      4      43
4   5      5      45
5   6      6      56

In [34]:
temp = temp.groupby(['id'])['value'].apply(lambda x :x.sum())

In [35]:
temp

id
1    27
4     4
5     5
6     6
Name: value, dtype: int64

In [27]:
temp['value_shift'] = temp.groupby('id')['value'].shift(1);temp

   id  value  value_shift
0   1     22          NaN
1   1      2         22.0
2   1      3          2.0
3   4      4          NaN
4   5      5          NaN
5   6      6          NaN